#include "clipboard.h"
//----------------------------------------------------------------------------------------------
static EteraClipboard* g_clipboard = NULL;
//----------------------------------------------------------------------------------------------

void EteraClipboard::init()
{
    g_clipboard = new EteraClipboard();
}
//----------------------------------------------------------------------------------------------

void EteraClipboard::cleanup()
{
    delete g_clipboard;
}
//----------------------------------------------------------------------------------------------

EteraClipboard* EteraClipboard::instance()
{
    return g_clipboard;
}
//----------------------------------------------------------------------------------------------

EteraClipboard::EteraClipboard() : EteraItemList()
{
    m_copy_mode = true;
}
//----------------------------------------------------------------------------------------------

EteraClipboard::~EteraClipboard()
{
}
//----------------------------------------------------------------------------------------------

void EteraClipboard::removeByPath(const QString& path)
{
    // оптимизировать при необходимости
    for (int i = 0; i < count(); i++)
        if (at(i).path() == path) {
            removeAt(i);
            break;
        }
}
//----------------------------------------------------------------------------------------------
